Practica2/blackJackns.playerMove.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:blackJackns="http://tempuri.org/blackJackns.xsd">
 <SOAP-ENV:Body>
  <blackJackns:playerMove>
   <playerName>
    <msg></msg>
   </playerName>
   <gameId>0</gameId>
   <move>0</move>
  </blackJackns:playerMove>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
